"use strict";
/**
 * Created by Hyeonmin on 2017-03-15.
 */
var MockService = (function () {
    function MockService() {
        this.fields_articles = [
            {
                date: '2017-03-15',
                title: '비거주자에게 증여하는 경우',
                tags: '증여세'
            },
            {
                date: '2017-03-15',
                title: '수증자의 증여세를 증여자가 납부하여 주는 경우',
                tags: '증여세'
            },
            {
                date: '2017-03-14',
                title: '적립식 펀드, 증여금액 변동',
                tags: '펀드 적립식 증여금 투자'
            },
            {
                date: '2017-03-12',
                title: '1세대 2주택자의 선택',
                tags: ''
            },
            {
                date: '2017-03-12',
                title: '상속인외의 자에게 증여시 주의사항',
                tags: '상속세 증여세'
            },
            {
                date: '2017-03-12',
                title: '상장주식 양도세 대주주 확대',
                tags: ''
            },
            {
                date: '2017-03-11',
                title: '임원퇴직금 중간정산검토',
                tags: ''
            },
            {
                date: '2017-03-09',
                title: '과점주주의 제2차 납세의무',
                tags: '납세 과점'
            },
            {
                date: '2017-03-08',
                title: '포유세무사의 세무조사 완전정복 4 - 특별조사의 방법과 대응방법, 사후절차가 궁금합니다.',
                tags: '특별조사 조사대응 조사사후'
            },
            {
                date: '2017-03-06',
                title: '포유세무사의 세무조사 완전정복 3 - 세무조사는 어떻게 하나요? - 일반조사',
                tags: '세무조사'
            },
            {
                date: '2017-03-06',
                title: '포유세무사의 세무조사 완전정복 2 - 세무조사의 종류가 궁금합니다.',
                tags: '세무조사'
            },
            {
                date: '2017-03-04',
                title: '포유세무사의 세무조사 완전정복 1 - 세무조사의 개념 및 조사대상 선정방법',
                tags: '세무조사 조사대상'
            },
            {
                date: '2017-03-04',
                title: '5월은 종합소득세 신고의 달',
                tags: '종합소득세'
            },
            {
                date: '2017-03-04',
                title: '창업자금 증여 세제를 개선하여 성장 동력을 되찾자',
                tags: '증여세 창업 자금'
            },
            {
                date: '2017-03-03',
                title: '재산의 원활한 세대이전을 통해 경제 활력을 되찾자.',
                tags: ''
            },
            {
                date: '2017-03-02',
                title: '교육과 생산성의 연관성',
                tags: ''
            },
            {
                date: '2017-02-28',
                title: '부동산 매매가액을 허위로 신고한다면?',
                tags: '부동산 허위신고 매매가'
            },
            {
                date: '2017-02-27',
                title: '매매계약서를 분실했을 때 취득가액의 계산',
                tags: '매매계약서 분실 취득가액'
            },
            {
                date: '2017-02-26',
                title: '타인의 사업과 재산에 이름을 빌려주면 안된다.',
                tags: ''
            },
            {
                date: '2017-03-04',
                title: '사업, 법인이 좋은가 개인이 좋은가?',
                tags: '법인 개인'
            },
        ];
    }
    return MockService;
}());
exports.MockService = MockService;
//# sourceMappingURL=mock.service.js.map